{
  "Logging": {
    "LogLevel": {
      "Default": "Information",
      "Microsoft.AspNetCore": "Warning"
      // Optional: Remove or change this line for Production builds if you don't want detailed SQL logging.
      // It's useful for development, less so for production unless debugging.
      // Environment variables could also override this if needed (e.g., Logging__LogLevel__Microsoft.EntityFrameworkCore.Database.Command=Warning)
      // "Microsoft.EntityFrameworkCore.Database.Command": "Information"
    }
  },
  "AllowedHosts": "*", // Generally fine for containerized apps behind potential proxies.
  "ConnectionStrings": {
    // This value is primarily for LOCAL DEVELOPMENT (running without Docker).
    // In the docker-compose setup, this specific string WILL BE OVERRIDDEN by the environment variable
    // ConnectionStrings__DefaultConnection=Server=db;Port=5432;...;User Id=digital;Password=digital;...
    // So, keep your local development connection string here if needed.
    "DefaultConnection": ""
  },
  "FileStorage": {
    // This value is the default/local development path.
    // In the docker-compose setup, this WILL BE OVERRIDDEN by the environment variable
    // FileStorage__BasePath=/app/uploads
    // Set this to your actual LOCAL path for non-Docker runs.
    // It should point to where the process running outside Docker has write access.
    "BasePath": "" // Your local macOS path for non-docker runs
    // Example Windows local path (commented out):
    // "BasePath": "C:\\FileStorage"
  },
  "SignedUrlSettings": {
    // IMPORTANT: The value here should NOT be your real production secret key.
    // In the docker-compose setup, this WILL BE OVERRIDDEN by the environment variable
    // SignedUrlSettings__SecretKey which should source the real key securely (e.g., from .env or secrets manager).
    // This placeholder is for local development only or as a non-functional default.
    "SecretKey": "DEV_SECRET_ONLY_DO_NOT_USE_IN_PROD_GET_FROM_ENV_OR_SECRETS",
    // This value acts as a default. It WILL BE OVERRIDDEN by the environment variable
    // SignedUrlSettings__MaxExpiryMinutes=10080 in the docker-compose file.
    "MaxExpiryMinutes": 10080 // Default max duration (e.g., 7 days)
  }
  // AllowedApiKeys - Manage these outside appsettings for better security, e.g., DB seed or separate config provider.
}